#### Terraform Plan (Prod) 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_iam_workload_identity_pool.github_pool: Refreshing state... [id=projects/calendarsync-napier/locations/global/workloadIdentityPools/github-pool]
data.google_project.project: Reading...
google_service_account.github_actions: Refreshing state... [id=projects/calendarsync-napier/serviceAccounts/github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_project_service.iam_api: Refreshing state... [id=calendarsync-napier/iam.googleapis.com]
google_project_service.calendar_api: Refreshing state... [id=calendarsync-napier/calendar-json.googleapis.com]
google_project_service.tasks_api: Refreshing state... [id=calendarsync-napier/cloudtasks.googleapis.com]
google_project_service.artifact_registry_api: Refreshing state... [id=calendarsync-napier/artifactregistry.googleapis.com]
google_project_service.cloudbuild_api: Refreshing state... [id=calendarsync-napier/cloudbuild.googleapis.com]
google_cloud_run_domain_mapping.default: Refreshing state... [id=locations/us-central1/namespaces/calendarsync-napier/domainmappings/calendarsync.billnapier.com]
google_project_service.iamcredentials_api: Refreshing state... [id=calendarsync-napier/iamcredentials.googleapis.com]
google_project_service.secretmanager_api: Refreshing state... [id=calendarsync-napier/secretmanager.googleapis.com]
data.google_iam_policy.noauth: Reading...
data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_project_service.firestore_api: Refreshing state... [id=calendarsync-napier/firestore.googleapis.com]
google_project_service.serviceusage_api: Refreshing state... [id=calendarsync-napier/serviceusage.googleapis.com]
data.google_project.project: Read complete after 1s [id=projects/calendarsync-napier]
google_project_service.cloudresourcemanager_api: Refreshing state... [id=calendarsync-napier/cloudresourcemanager.googleapis.com]
google_project_service.cloudscheduler_api: Refreshing state... [id=calendarsync-napier/cloudscheduler.googleapis.com]
google_project_service.run_api: Refreshing state... [id=calendarsync-napier/run.googleapis.com]
google_project_iam_member.github_actions_run_admin: Refreshing state... [id=calendarsync-napier/roles/run.admin/serviceAccount:github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_project_iam_member.github_actions_sa_user: Refreshing state... [id=calendarsync-napier/roles/iam.serviceAccountUser/serviceAccount:github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_iam_workload_identity_pool_provider.github_provider: Refreshing state... [id=projects/calendarsync-napier/locations/global/workloadIdentityPools/github-pool/providers/github-provider]
google_project_iam_member.github_actions_editor: Refreshing state... [id=calendarsync-napier/roles/editor/serviceAccount:github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_project_iam_member.github_actions_service_usage: Refreshing state... [id=calendarsync-napier/roles/serviceusage.serviceUsageAdmin/serviceAccount:github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_service_account_iam_member.github_actions_wif_user: Refreshing state... [id=projects/calendarsync-napier/serviceAccounts/github-actions-sa@calendarsync-napier.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/179450231286/locations/global/workloadIdentityPools/github-pool/attribute.repository/billnapier/calendarsync]
google_project_iam_member.github_actions_artifact_registry: Refreshing state... [id=calendarsync-napier/roles/artifactregistry.writer/serviceAccount:github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_project_iam_member.github_actions_wif_admin: Refreshing state... [id=calendarsync-napier/roles/iam.workloadIdentityPoolAdmin/serviceAccount:github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_project_iam_member.github_actions_iam_admin: Refreshing state... [id=calendarsync-napier/roles/resourcemanager.projectIamAdmin/serviceAccount:github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_project_iam_member.cloudbuild_run_admin: Refreshing state... [id=calendarsync-napier/roles/run.admin/serviceAccount:179450231286@cloudbuild.gserviceaccount.com]
google_project_service.identitytoolkit_api: Refreshing state... [id=calendarsync-napier/identitytoolkit.googleapis.com]
google_artifact_registry_repository.repo: Refreshing state... [id=projects/calendarsync-napier/locations/us-central1/repositories/python-cloudrun-app]
google_project_service.firebase_api: Refreshing state... [id=calendarsync-napier/firebase.googleapis.com]
google_firestore_database.default: Refreshing state... [id=projects/calendarsync-napier/databases/(default)]
google_cloud_tasks_queue.sync_queue: Refreshing state... [id=projects/calendarsync-napier/locations/us-central1/queues/sync-queue]
google_firebase_project.default: Refreshing state... [id=projects/calendarsync-napier]
google_firebase_web_app.default: Refreshing state... [id=projects/calendarsync-napier/webApps/1:179450231286:web:062abd3c40b3b6a3abefd7]
google_cloud_run_service.default: Refreshing state... [id=locations/us-central1/namespaces/calendarsync-napier/services/python-cloudrun-app]
google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/calendarsync-napier/locations/us-central1/services/python-cloudrun-app]
google_identity_platform_config.default: Refreshing state... [id=projects/calendarsync-napier/config]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # google_cloud_run_service.default has changed
  ~ resource "google_cloud_run_service" "default" {
        id                         = "locations/us-central1/namespaces/calendarsync-napier/services/python-cloudrun-app"
        name                       = "python-cloudrun-app"
      ~ status                     = [
          ~ {
              ~ latest_created_revision_name = "python-cloudrun-app-00019-g9t" -> "python-cloudrun-app-00033-w5h"
              ~ latest_ready_revision_name   = "python-cloudrun-app-00019-g9t" -> "python-cloudrun-app-00033-w5h"
              ~ observed_generation          = 19 -> 33
              ~ traffic                      = [
                  ~ {
                      ~ revision_name   = "python-cloudrun-app-00019-g9t" -> "python-cloudrun-app-00033-w5h"
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (2 unchanged attributes hidden)
            },
        ]
        # (3 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_firebase_web_app_config.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_firebase_web_app_config" "default" {
      + api_key             = (known after apply)
      + auth_domain         = (known after apply)
      + database_url        = (known after apply)
      + id                  = (known after apply)
      + location_id         = (known after apply)
      + measurement_id      = (known after apply)
      + messaging_sender_id = (known after apply)
      + storage_bucket      = (known after apply)
      + web_app_id          = "1:179450231286:web:062abd3c40b3b6a3abefd7"
    }

  # google_cloud_run_domain_mapping.default will be destroyed
  # (because google_cloud_run_domain_mapping.default is not in configuration)
  - resource "google_cloud_run_domain_mapping" "default" {
      - id       = "locations/us-central1/namespaces/calendarsync-napier/domainmappings/calendarsync.billnapier.com" -> null
      - location = "us-central1" -> null
      - name     = "calendarsync.billnapier.com" -> null
      - project  = "calendarsync-napier" -> null
      - status   = [
          - {
              - conditions          = [
                  - {
                      - status  = "True"
                      - type    = "Ready"
                        # (2 unchanged attributes hidden)
                    },
                  - {
                      - status  = "True"
                      - type    = "CertificateProvisioned"
                        # (2 unchanged attributes hidden)
                    },
                  - {
                      - status  = "True"
                      - type    = "DomainRoutable"
                        # (2 unchanged attributes hidden)
                    },
                ]
              - mapped_route_name   = "python-cloudrun-app"
              - observed_generation = 1
              - resource_records    = [
                  - {
                      - name   = "calendarsync"
                      - rrdata = "ghs.googlehosted.com."
                      - type   = "CNAME"
                    },
                ]
            },
        ] -> null

      - metadata {
          - annotations           = {} -> null
          - effective_annotations = {
              - "run.googleapis.com/operation-id"  = "b5515ebc-d852-4d98-8f85-560666b2cd6f"
              - "serving.knative.dev/creator"      = "billnapier@gmail.com"
              - "serving.knative.dev/lastModifier" = "billnapier@gmail.com"
            } -> null
          - effective_labels      = {
              - "cloud.googleapis.com/location" = "us-central1"
              - "run.googleapis.com/overrideAt" = "2025-12-26T03:56:30.371Z"
            } -> null
          - generation            = 1 -> null
          - labels                = {} -> null
          - namespace             = "calendarsync-napier" -> null
          - resource_version      = "AAZG0wjTmyI" -> null
          - self_link             = "/apis/domains.cloudrun.com/v1/namespaces/179450231286/domainmappings/calendarsync.billnapier.com" -> null
          - terraform_labels      = {} -> null
          - uid                   = "94689cba-d62e-4d72-b598-be54203ec782" -> null
        }

      - spec {
          - certificate_mode = "AUTOMATIC" -> null
          - force_override   = false -> null
          - route_name       = "python-cloudrun-app" -> null
        }
    }

  # google_cloud_run_service.default will be updated in-place
  ~ resource "google_cloud_run_service" "default" {
        id                         = "locations/us-central1/namespaces/calendarsync-napier/services/python-cloudrun-app"
        name                       = "python-cloudrun-app"
        # (4 unchanged attributes hidden)

      ~ metadata {
          ~ terraform_labels      = {
              + "commit-sha" = "204be6788523b211c79a84cd627548e089645d34"
              + "managed-by" = "github-actions"
            }
            # (9 unchanged attributes hidden)
        }

      ~ template {
          ~ spec {
              ~ service_account_name  = "179450231286-compute@developer.gserviceaccount.com" -> "app-runner@calendarsync-napier.iam.gserviceaccount.com"
                # (4 unchanged attributes hidden)

              ~ containers {
                    name        = null
                    # (4 unchanged attributes hidden)

                  - env {
                      - name  = "FIREBASE_API_KEY" -> null
                      - value = "AIzaSyBW7LMSxjdY3FtH7y8DNOYqxCydSE5sv_o" -> null
                    }
                  - env {
                      - name  = "FIREBASE_AUTH_DOMAIN" -> null
                      - value = "calendarsync-napier.firebaseapp.com" -> null
                    }
                  - env {
                      - name  = "FIREBASE_MESSAGING_SENDER_ID" -> null
                      - value = "179450231286" -> null
                    }
                  - env {
                      - name  = "FIREBASE_STORAGE_BUCKET" -> null
                      - value = "calendarsync-napier.firebasestorage.app" -> null
                    }
                  + env {
                      + name  = "FIREBASE_API_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_AUTH_DOMAIN"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_MESSAGING_SENDER_ID"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_STORAGE_BUCKET"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "GCP_REGION"
                      + value = "us-central1"
                    }
                  + env {
                      + name  = "SCHEDULER_INVOKER_EMAIL"
                      + value = "scheduler-invoker@calendarsync-napier.iam.gserviceaccount.com"
                    }

                    # (8 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_cloud_run_service_iam_member.scheduler_invoker will be created
  + resource "google_cloud_run_service_iam_member" "scheduler_invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "serviceAccount:scheduler-invoker@calendarsync-napier.iam.gserviceaccount.com"
      + project  = "calendarsync-napier"
      + role     = "roles/run.invoker"
      + service  = "python-cloudrun-app"
    }

  # google_cloud_scheduler_job.sync_all will be created
  + resource "google_cloud_scheduler_job" "sync_all" {
      + description = "Trigger sync for all users"
      + id          = (known after apply)
      + name        = "sync-all-users"
      + paused      = (known after apply)
      + project     = "calendarsync-napier"
      + region      = "us-central1"
      + schedule    = "0 * * * *"
      + state       = (known after apply)
      + time_zone   = "Etc/UTC"

      + http_target {
          + http_method = "POST"
          + uri         = "https://python-cloudrun-app-upgl3iqnkq-uc.a.run.app/tasks/sync_all"

          + oidc_token {
              + service_account_email = "scheduler-invoker@calendarsync-napier.iam.gserviceaccount.com"
            }
        }
    }

  # google_firebase_hosting_custom_domain.default will be created
  + resource "google_firebase_hosting_custom_domain" "default" {
      + cert                  = (known after apply)
      + cert_preference       = (known after apply)
      + create_time           = (known after apply)
      + custom_domain         = "calendarsync.billnapier.com"
      + delete_time           = (known after apply)
      + etag                  = (known after apply)
      + expire_time           = (known after apply)
      + host_state            = (known after apply)
      + id                    = (known after apply)
      + issues                = (known after apply)
      + name                  = (known after apply)
      + ownership_state       = (known after apply)
      + project               = "calendarsync-napier"
      + reconciling           = (known after apply)
      + required_dns_updates  = (known after apply)
      + site_id               = "calendarsync-napier"
      + update_time           = (known after apply)
      + wait_dns_verification = false
    }

  # google_firebase_web_app.default will be updated in-place
  ~ resource "google_firebase_web_app" "default" {
      ~ deletion_policy = "ABANDON" -> "DELETE"
        id              = "projects/calendarsync-napier/webApps/1:179450231286:web:062abd3c40b3b6a3abefd7"
        name            = "projects/calendarsync-napier/webApps/1:179450231286:web:062abd3c40b3b6a3abefd7"
        # (5 unchanged attributes hidden)
    }

  # google_identity_platform_config.default will be updated in-place
  ~ resource "google_identity_platform_config" "default" {
        id                         = "projects/calendarsync-napier/config"
        name                       = "projects/179450231286/config"
        # (3 unchanged attributes hidden)

      - multi_tenant {
          - allow_tenants           = false -> null
            # (1 unchanged attribute hidden)
        }

      - timeouts {}

        # (4 unchanged blocks hidden)
    }

  # google_project_iam_member.app_runner_firestore will be created
  + resource "google_project_iam_member" "app_runner_firestore" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:app-runner@calendarsync-napier.iam.gserviceaccount.com"
      + project = "calendarsync-napier"
      + role    = "roles/datastore.user"
    }

  # google_project_iam_member.app_runner_logging will be created
  + resource "google_project_iam_member" "app_runner_logging" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:app-runner@calendarsync-napier.iam.gserviceaccount.com"
      + project = "calendarsync-napier"
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_member.app_runner_secrets will be created
  + resource "google_project_iam_member" "app_runner_secrets" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:app-runner@calendarsync-napier.iam.gserviceaccount.com"
      + project = "calendarsync-napier"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_project_iam_member.cloud_run_tasks_enqueuer will be created
  + resource "google_project_iam_member" "cloud_run_tasks_enqueuer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:app-runner@calendarsync-napier.iam.gserviceaccount.com"
      + project = "calendarsync-napier"
      + role    = "roles/cloudtasks.enqueuer"
    }

  # google_service_account.app_runner will be created
  + resource "google_service_account" "app_runner" {
      + account_id   = "app-runner"
      + disabled     = false
      + display_name = "Cloud Run Service Account"
      + email        = "app-runner@calendarsync-napier.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:app-runner@calendarsync-napier.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "calendarsync-napier"
      + unique_id    = (known after apply)
    }

  # google_service_account.scheduler_invoker will be created
  + resource "google_service_account" "scheduler_invoker" {
      + account_id   = "scheduler-invoker"
      + disabled     = false
      + display_name = "Cloud Scheduler Invoker"
      + email        = "scheduler-invoker@calendarsync-napier.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:scheduler-invoker@calendarsync-napier.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "calendarsync-napier"
      + unique_id    = (known after apply)
    }

Plan: 9 to add, 3 to change, 1 to destroy.

Changes to Outputs:
  ~ dns_records               = [
      - {
          - conditions          = [
              - {
                  - message = ""
                  - reason  = ""
                  - status  = "True"
                  - type    = "Ready"
                },
              - {
                  - message = ""
                  - reason  = ""
                  - status  = "True"
                  - type    = "CertificateProvisioned"
                },
              - {
                  - message = ""
                  - reason  = ""
                  - status  = "True"
                  - type    = "DomainRoutable"
                },
            ]
          - mapped_route_name   = "python-cloudrun-app"
          - observed_generation = 1
          - resource_records    = [
              - {
                  - name   = "calendarsync"
                  - rrdata = "ghs.googlehosted.com."
                  - type   = "CNAME"
                },
            ]
        },
    ] -> (known after apply)
  ~ firebase_config           = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @billnapier, Action: `pull_request`*